PREFERENCES = {
    "דן אלוני": [
        "חסה",
        "מלפפון",
        "גזר",
        "פסטה",
        "תירס",
        "כרוב לבן",
        "נבטים",
        "מלפפון חמוץ",
        "תיבול שמן זית",
        "וינגריט בלסמי",
        "איטלקי חריף"
    ],
    "Lior Segev": [
        "חסה",
        "עלי בייבי",
        "גזר",
        "תירס",
        "פלפל צהוב קלוי בתנור",
        "אפונה ירוקה",
        "עדשים שחורים",
        "חציל בתנור",
        "גרעיני חומוס",
        "קישואים בתנור",
        "עירית",
        "תיבול לימון",
        "טחינה"
    ],
    "Shahar Lev": [
        "עגבניה",
        "מלפפון",
        "נבטים",
        "קרוטונים|0.5",
        "פסטו",
        "תיבול בזיליקום"
    ],
    "Maor Vanmak": [
        "חסה",
        "מלפפון חמוץ",
        "פלפל אדום",
        "עגבניות שרי",
        "עגבניה",
        "תירס",
        "תיבול לימון",
        "גרעיני חמנייה",
        "זיתים שחורים",
        "טחינה",
        "איטלקי חריף"
    ],
    "אריאל מייסלוס": [
        "עלי בייבי",
        "תירס",
        "נבטים",
        "נבטי חמנייה",
        "אפונה ירוקה",
        "שעועית ירוקה",
        "בצל סגול",
        "סלק אדום מגורד",
        "עגבניות שרי",
        "חציל בתנור",
        "פטריות",
        "קישואים בתנור",
        "עלי בייבי",
        "כדורי מוצרלה",
        "זעתר",
        "ויניגרט הדרים",
        "תיבול זעתר",
        "טחינה"
    ],
    "רותם דפני": [
        "מלפפון",
        "גזר",
        "תירס",
        "כרוב לבן",
        "פלפל אדום",
        "נבטי חמנייה",
        "בצל סגול",
        "מלפפון חמוץ",
        "עגבניות שרי",
        "זיתים ירוקים",
        "ביצה קשה",
        "תיבול שמן זית",
        "עשבי תיבול"
    ],
    "ליעז קמפר": [
        "עגבניה",
        "תירס",
        "נבטים",
        "אפונה ירוקה",
        "כרוב לבן",
        "סלק אדום מגורד",
        "עגבניות שרי",
        "חציל בתנור",
        "פלפל אדום",
        "מלפפון",
        "גזר",
        "פטריות",
        "כרוב לבן",
        "קישואים בתנור",
        "טחינה"
    ],
    "דורון גיל": [
        "מלפפון",
        "גזר",
        "תירס",
        "כרוב אדום",
        "כרוב לבן",
        "נבטים",
        "נבטי חמנייה",
        "שעועית ירוקה",
        "מלפפון חמוץ",
        "חמוציות",
        "עגבניות שרי",
        "פטריות",
        "זיתים שחורים",
        "גרעיני חומוס",
        "גרעיני חמנייה",
        "גבינת עיזים",
        "טונה",
        "תיבול לימון",
        "וינגריט בלסמי"
    ],
    "חן שמלה": [
        "מלפפון",
        "גזר",
        "אפונה ירוקה",
        "תירס",
        "פלפל צהוב קלוי בתנור",
        "פלפל אדום",
        "תפוח אדמה",
        "קרוטונים",
        "עגבניות שרי",
        "קישואים בתנור",
        "ביצה קשה",
        "פטרוזיליה",
        "תיבול לימון",
        "טחינה",
        "חרדל ודבש"
    ],
    "איתי בוגנר": [
        "מלפפון",
        "גזר",
        "אפונה ירוקה",
        "תירס",
        "פלפל צהוב קלוי בתנור",
        "פלפל אדום",
        "תפוח אדמה",
        "קרוטונים",
        "עגבניות שרי",
        "קישואים בתנור",
        "ביצה קשה",
        "פטרוזיליה",
        "תיבול לימון",
        "טחינה",
        "חרדל ודבש"
    ],

    "סימון גרינברג": [
        "עלי בייבי",
        "מלפפון",
        "פלפל אדום",
        "פלפל ירוק",
        "נבטי חמנייה",
        "אפונה ירוקה",
        "סלק אדום מגורד",
        "עדשים שחורים",
        "עגבניות שרי",
        "גרעיני חומוס",
        "עירית",
        "פטרוזיליה",
        "תיבול בזיליקום",
        "איטלקי חריף"
    ],
    "זיוון עורי": [
        "חסה",
        "מלפפון",
        "עגבניה",
        "עלי בייבי",
        "פלפל אדום",
        "נבטים",
        "סלק אדום מגורד",
        "עדשים שחורים",
        "תפוח אדמה",
        "שעועית ירוקה",
        "בצל ירוק",
        "פטריות",
        "גרעיני חמנייה",
        "נבטי חמנייה",
        "בורגול",
        "גבינת עיזים",
        "תיבול שמן זית",
        "וינגריט בלסמי",
        "איטלקי חריף"
    ],
    "אדוארדו ורסבסקי": [
        "חסה",
        "עגבניה",
        "קוסלו-כרוב עם גזר במיונז",
        "תפוח אדמה",
        "עגבניות שרי",
        "זיתים ירוקים",
        "ביצה קשה",
        "תיבול לימון",
        "טחינה"
    ],
    "פבל פוקס": [
        "חסה",
        "עלי בייבי",
        "עגבניה",
        "גזר",
        "פסטה",
        "תירס",
        "פלפל אדום",
        "נבטים",
        "נבטי חמנייה",
        "בצל סגול",
        "עגבניות שרי",
        "חציל בתנור",
        "גרעיני חמנייה",
        "עירית",
        "בצל ירוק",
        "פטרוזיליה",
        "תיבול זעתר",
        "וינגריט בלסמי",
        "פסטו",
        "בולגרית"
    ],
    "אבל גורדון": [
        "עגבניות שרי",
        "בולגרית",
        "גזר",
        "פסטה",
        "תירס",
        "בצל סגול",
        "פטריות",
        "פלפל צהוב קלוי בתנור",
        "תיבול שמן זית",
        "אפונה ירוקה",
        "גרעיני חומוס",
        "חציל בתנור",
        "טחינה"
    ],
    "שמשון צימרמן": [
        "מלפפון",
        "גזר",
        "עדשים שחורים",
        "זיתים שחורים",
        "שעועית ירוקה",
        "קרוטונים",
        "גרעיני חומוס",
        "פסטה",
        "תפוח אדמה",
        "גרעיני חמניה",
        "תירס",
        "כרוב לבן",
        "נבטי חמנייה",
        "מלפפון חמוץ",
        "תיבול שמן זית",
        "עשבי תיבול",
        "פסטו"
    ],
    "Eran Cohen": [
        "מלפפון",
        "גזר",
        "תירס",
        "נבטים",
        "אפונה ירוקה",
        "פלפל אדום",
        "שעועית ירוקה",
        "עגבניה",
        "פטריות",
        "גרעיני חמנייה",
        "בצל ירוק",
        "קרוטונים",
        "זיתים ירוקים",
        "תיבול זעתר",
        "וינגריט בלסמי",
        "וינגריט הדרים"
    ],
    "אבישי טריגר": [
        "מלפפון",
        "גזר",
        "תירס",
        "עדשים שחורים",
        "אפונה ירוקה",
        "פלפל אדום",
        "שעועית ירוקה",
        "עגבניה",
        "פטריות",
        "גרעיני חמנייה",
        "קרוטונים",
        "זיתים ירוקים",
        "חסה",
        "תיבול לימון",
        "בצל ירוק",
        "עשבי תיבול",
        "איטלקי חריף"
    ],
    "Eyal Posener": [
        "מלפפון",
        "תירס",
        "קוסלו-כרוב עם גזר במיונז",
        "עגבניות שרי",
        "נבטי חמנייה",
        "גרעיני חמנייה",
        "בצל סגול",
        "חמוציות",
        "פטרוזיליה",
        "עלי בייבי",
        "נבטים",
        "סלק אדום מגורד",
        "חמוציות",
        "קרוטונים",
        "פטריות",
        "עירית",
        "פלפל צהוב קלוי בתנור",
        "נבטי חמניה",
        "תפוח אדמה",
        "עגבניות שרי",
        "בצל ירוק",
        "תיבול בזיליקום",
        "שום ולימון",
        "פסטו"
    ],
    "גיא קרמניצר": [
        "חסה",
        "עלי בייבי",
        "גזר",
        "תירס",
        "פלפל צהוב קלוי בתנור",
        "אפונה ירוקה",
        "עדשים שחורים",
        "חציל בתנור",
        "גרעיני חומוס",
        "קישואים בתנור",
        "עירית",
        "תיבול לימון",
        "טחינה"
    ],
    "Yael Feldmann": [
        "מלפפון",
        "פלפל ירוק",
        "חמוציות",
        "קישואים בתנור",
        "גזר",
        "פלפל אדום",
        "נבטים",
        "פטריות",
        "עגבניה",
        "נבטי חמנייה",
        "תפוח אדמה",
        "מלפפון חמוץ",
        "גרעיני חמנייה",
        "טונה",
        "טחינה",
        "ויניגרט הדרים"
    ],
    "עומר גולץ" : [
        "חסה",
        "מלפפון",
        "פלפל אדום",
        "פטריות",
        "עגבניה",
        "כרוב אדום",
        "גרעיני חמנייה",
        "בצל ירוק",
        "תיבול לימון",
        "טחינה",
        "עשבי תיבול"
    ],
		"אורן קיסלר": [
				"מלפפון",
				"בצל סגול",
				"חציל בתנור",
				"פטרוזיליה",
				"עלי בייבי",
				"עירית",
				"עגבניה",
				"תפוח אדמה",
				"מלפפון חמוץ",
				"עגבניות שרי",
				"זיתים ירוקים",
				"ביצה קשה",
				"בולגרית",
				"גבינת עיזים",
				"תיבול שמן זית",
				"טחינה",
				"שום לימון"
		],
		"מיקי גורדון": [
				"חסה",
				"עגבניה",
				"מלפפון",
				"פסטה",
				"תירס",
				"פלפל אדום",
				"תפוח אדמה",
				"טונה",
				"ביצה קשה",
				"תיבול שמן זית",
				"פסטו"
		],
		"שרית בן עמי": [
				"מלפפון",
				"גזר",
				"תירס",
				"סלק אדום מגורד",
				"פסטה",
				"חמוציות",
				"עדשים שחורים",
				"תיבול שמן זית",
				"כדורי מוצרלה",
				"בורגול",
				"בולגרית",
				"טחינה"
		],
		"מאיה גרין": [
				"גזר",
				"פסטה",
				"תירס",
				"פלפל אדום",
				"פלפל צהוב קלוי בתנור",
				"אפונה ירוקה",
				"סלק אדום מגורד",
				"פטריות",
				"קישואים בתנור",
				"סלט טונה",
				"תיבול לימון",
				"ויניגרט הדרים"
		],
		"יעל פרנק": [
				"חסה",
				"מלפפון",
				"עגבניה",
				"גזר",
				"נבטים",
				"נבטי חמנייה",
				"שעועית ירוקה",
				"סלק אדום מגורד",
				"קרוטונים",
				"חציל בתנור",
				"בורגול",
				"תיבול לימון",
				"וינגריט בלסמי",
				"ויניגרט הדרים"
		]
};


ITEM_CLASS_NAME = "dishContent_dishDetailsLI";
USER_SELECT_QUERY = "select[data-dish-assigned-users-select]";

function maybe(probability) {
    return (Math.random() < probability)
}

function getPersonName() {
    var select = document.querySelector(USER_SELECT_QUERY);
    var selectedOption = select.getElementsByTagName("option")[select.selectedIndex];
    return getText(selectedOption).replace(/\s+/g, " ");
}

function getText(element) {
    return element.textContent.replace(/\([^)]+\)/g, '').replace(/^\s+|\s+$/g,'')
}

function chosen(userPreferences, option) {
    var result = false;
    userPreferences.forEach(function (up) {
        var userPreference = up.split("|");
        if (userPreference[0] == option) {
            if (userPreference[1]) {
                result = maybe(parseFloat(userPreference[1]))
            } else {
                result = true
            }
        }
    });
    return result;
}

function autofill() {
    var personName = getPersonName();
    var statusNode = document.createElement("span");
    var wrapper = document.querySelector("#dishContent div[data-dish-assigned-users]");

    if (!(personName in PREFERENCES)) {
        alert("Who the #$%^@ is '" + personName + "' ?!?");
        return;
    }

    statusNode.textContent = " → another example of great taste is being applied ";
    wrapper.appendChild(statusNode);

    setTimeout(function() {
        var labels = document.querySelectorAll("#dishContent label");
        for (var i = 0; i < labels.length; i++) {
            var label = labels[i];
            var labelText = getText(label);
            if (chosen(PREFERENCES[personName], labelText)) {
                label.querySelector("input").click();
            }
        }
        wrapper.removeChild(statusNode);

    }, 20);

}
